server/stress/stress.yml
config:
  target: 'http://localhost:3006'
  processor: './artilleryFunc.js'
  ensure:
    p95: 3000
  phases:
    - duration: 60
      arrivalRate: 100
scenarios:
  - flow:
    - function: 'generateGetRequestData'
    - get:
        url: '/api/reservations/{{listingID}}'
    - think: 10
    count: 15